---
kind: method
id: M:Autodesk.Revit.DB.PlanTopologySet.#ctor
source: html/3bb6037d-39be-3517-c0ad-3921b39803ca.htm
---
# Autodesk.Revit.DB.PlanTopologySet.#ctor Method

Initializes a new instance of the PlanTopologySet class

## Syntax (C#)
```csharp
public PlanTopologySet()
```